app/controllers/authors_controller.rb

  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "email_address", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Test"], ["last_name", "Test"], ["email_address", "test"], ["user_id", 1], ["created_at", "2021-10-11 17:33:07.898412"], ["updated_at", "2021-10-11 17:33:07.898412"]]

  def destroy
    @author.destroy
---
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 1]]

  def correct_user
    @author = current_user.authors.find_by(id: params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."user_id" = ? AND "authors"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]