app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
  def index
    @ingredients = Ingredient.all

INSERT INTO "ingredients" ("ingredient_name", "amount", "unit", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["ingredient_name", "MyString"], ["amount", 9.99], ["unit", "MyString"], ["recipe_id", 1], ["created_at", "2021-10-11 14:36:00.504899"], ["updated_at", "2021-10-11 14:36:00.504899"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 980190962]]
---
  def destroy
    @ingredient.destroy

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
---
    def set_ingredient
      @ingredient = Ingredient.find(params[:id])