app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("recipe_name", "difficulty", "comment", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["recipe_name", "cake"], ["difficulty", "Easy"], ["comment", "Yum!"], ["author_id", 1], ["created_at", "2021-10-12 05:33:08.633030"], ["updated_at", "2021-10-12 05:33:08.633030"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
  def destroy
    @recipe.destroy